DEPARTMENTS = (
    ('1', "Дирекция"),
    ('2', "Служба финансового директора"),
    ('3', "Служба коммерческого директора"),
    ('4', "Служба технического директора"),
    ('5', "Группа проектного проектирования"),
    ('6', "Бухгалтерия")

)

POSITIONS = (
    ('1', "Генеральный директор"),
    ('2', "Советник генерального директора"),
    ('3', "Главный бухгалтер"),
    ('4', "Финансовый директор"),
    ('5', "Комерческий директор"),
    ('6', "Технический директор"),
    ('7', "Бухгалтер"),
    ('8', "Экономист"),
    ('9', "Юрисконсульт"),
    ('10', "Заместитель технического директора - главный технолог"),
    ('11', "Заместитель коммерческого директора"),
    ('12', "Заместитель финансового директора"),
    ('13', "Главный конструктор"),
    ('14', "Секретарь Генерального директора"),
    ('15', "Главный специалист по работе персоналом"),
    ('16', "Специалист по административно-хозяйственной деятельности"),
    ('17', "Ведущий инженер"),
    ('18', "Руководитель проекта"),
    ('19', "Архитектор проекта"),
    ('20', "Ведущий инженер-конструктор"),
    ('21', "Инженер-конструктор 1 категории"),
    ('22', "Инженер-конструктор 2 категории"),
    ('23', "Ведущий специалист по СМБ"),
    ('24', "Руководитель отдела сертификации"),
    ('25', "Инженер-конструктор по расчетам 2 категории"),
    ('26', "Руководитель по управлению качеством"),
    ('27', "Специалист по диспетчеризации"),
    ('28', "Менеджер по продажам"),
    ('29', "Инженер-аналитик"),

)

STAFF = (
    ('1', 'Фамилия1 Имя1 Отчество1 '),
    ('2', 'Фамилия2 Имя2 Отчество2 '),
    ('3', 'Фамилия3 Имя3 Отчество3 '),
    ('4', 'Фамилия4 Имя4 Отчество4 '),
    ('5', 'Фамилия5 Имя5 Отчество5 '),
    ('6', 'Фамилия6 Имя6 Отчество6 '),
    ('7', 'Фамилия7 Имя7 Отчество7 '),
    ('8', 'Фамилия8 Имя8 Отчество8 '),
    ('9', 'Фамилия9 Имя9 Отчество9 '),
    ('10', 'Фамили10 Имя10 Отчество10 '),
    ('11', 'Фамилия11 Имя11 Отчество11 '),
    ('12', 'Фамилия12 Имя12 Отчество12 '),
    ('13', 'Фамилия13 Имя13 Отчество13 '),
    ('14', 'Фамилия14 Имя114 Отчество14 '),
)

