ДОЛЖНОСТИ = (
    ('1', "Генеральный директор"),
    ('2', "Советник генерального директора"),
    ('3', "Главный бухгалтер"),
    ('4', "Финансовый директор"),
    ('5', "Комерческий директор"),
    ('6', "Технический директор"),
    ('7', "Бухгалтер"),
    ('8', "Экономист"),
    ('9', "Юрисконсульт"),
    ('10', "Заместитель технического директора - главный технолог"),
    ('11', "Заместитель коммерческого директора"),
    ('12', "Заместитель финансового директора"),
    ('13', "Главный конструктор"),
    ('14', "Секретарь Генерального директора"),
    ('15', "Главный специалист по работе персоналом"),
    ('16', "Специалист по административно-хозяйственной деятельности"),
    ('17', "Ведущий инженер"),
    ('18', "Руководитель проекта"),
    ('19', "Архитектор проекта"),
    ('20', "Ведущий инженер-конструктор"),
    ('21', "Инженер-конструктор 1 категории"),
    ('22', "Инженер-конструктор 2 категории"),
    ('23', "Ведущий специалист по СМБ"),
    ('24', "Руководитель отдела сертификации"),
    ('25', "Инженер-конструктор по расчетам 2 категории"),
    ('26', "Руководитель по управлению качеством"),
    ('27', "Специалист по диспетчеризации"),
    ('28', "Менеджер по продажам"),
    ('29', "Инженер-аналитик")



)