from django import forms
from report_app.models import ReestrUsers
from report_app.report_users.modules_users.employees_and_departments import STAFF

TYPE_REASON = (
    (0, "-----"),
    (1, "снят с эксплуатации"),
    (2, "следуют в ремонт"),
    (3, "ремонт по гарантии"),
    (4, "ремонт не по гарантии"),
    (5, "расследуется"),
)

ТИП_СИСТЕМЫ = (
    (0, "-----"),
    (1, "ПСН"),
    (2, "МПСУиД"),
    (3, "СВОП"),
    (4, "КУ ПС"),
    (5, "КУ КМ"),
    (6, "Другое")

)

ПЕРИОДЫ = (
    (0, "январь"),
    (1, "февраль"),
    (2, "март"),
    (3, "апрель"),
    (4, "май"),
    (5, "июнь"),
    (6, "июль"),
    (7, "август"),
    (8, "сентябрь"),
    (9, "октябрь"),
    (10, "ноябрь"),
    (11, "декабрь"),
)

НОМЕР_ВАГОНА_СЕКЦИИ = (
    (0, "----"),
    (1, "1"),
    (2, "2"),
    (3, "3"),
    (4, "4"),
    (5, "5"),
    (6, "6"),
    (7, "7"),
    (8, "8"),
    (9, "9"),
    (10, "10"),

)

ЭЛЕКТРОВОЗЫ = (
    (0, "2ЭС6"),
    (1, "2ЭС7"),
    (2, "2ЭС10"),
    (3, "2ЭС10Б"),
)

ЭЛЕКТРОПОЕЗДА = (
    (0, "ЭС2Г"),
    (1, "ЭС2ГП"),
    (2, "ЭС1П"),
)

ДЕПО = (
    (0, '----'),
    (1, 'Свердловск-Сортировочный'),
    (2, 'Белово'),
    (3, 'Челябинск'),
    (4, 'Кинель'),
    (5, 'Омск'),
    (6, 'Курган'),
    (7, 'Волховстрой'),
    (8, 'Златоуст'),
    (9, 'Тайга'),
)

СЕРИЯ = (
    (0, '----'),
    (1, "2ЭС6"),
    (2, "2ЭС10"),
    (3, "2ЭС10Б"),
    (4, "ЭС2Г"),
    (5, "ЭС2ГП"),
    (6, "ЭС1П"),
    (7, "2ЭС7"),
)


def users():
    return ReestrUsers.reestr_man.all()


class FioForm(forms.Form):
    пользователи = forms.ChoiceField(label="пользователи", choices=STAFF)
